months = {"1": ["январь", "зима"], "2": ["февраль", "зима"], "3": ["март", "весна"],
          "4": ["апрель", "весна"], "5": ["май", "весна"], "6": ["июнь", "лето"],
          "7": ["июль", "лето"], "8": ["август", "лето"], "9": ["сентябрь", "осень"],
          "10": ["октябрь", "осень"], "11": ["ноябрь", "осень"], "12": ["декабрь", "зима"]}

user_input = input("введите номер месяца\n")
aux = months.get(user_input)
if aux:
    print(f"{aux[0]} это {aux[1]}")
else:
    print("некорректный ввод")
